livingSocial/app/controllers/items_controller.rb

  def index
    @items = if params[:merchant_id]
               Item.where("merchant_id = ?", params[:merchant_id])
             else
               Item.all
---
SELECT "items".* FROM "items" WHERE (merchant_id = '1')
SELECT "items".* FROM "items"