livingSocial/app/controllers/orders_controller.rb

  def index
    @error_message = params[:error_message] if params[:error_message]
    @orders = if params[:merchant_id]
                Order.get_orders_for 'merchant', params[:merchant_id]
              elsif params[:customer_id]
                Order.get_orders_for 'customer', params[:customer_id]
              elsif params[:item_id]
                Order.get_orders_for 'item', params[:item_id]
              else
                Order.all
---
SELECT "orders".* FROM "orders" WHERE (merchant_id = '1')

  def show
    @order = Order.find params[:id]
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    if current_user.blank?
      error_message = "You must sign in to import new orders."
      redirect_to(action: 'index', error_message: error_message) and return
    end
    line_num = 0
    header_row = []
    order = Order.create filename: params['upload']['datafile'].original_filename
---
INSERT INTO "orders" ("created_at", "customer_id", "item_id", "merchant_id", "purchase_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 15 Mar 2014 00:51:51 UTC +00:00], ["customer_id", 6], ["item_id", 1], ["merchant_id", 5], ["purchase_count", 2], ["updated_at", Sat, 15 Mar 2014 00:51:51 UTC +00:00]]