livingSocial/app/views/orders/index.html.erb

              <td>
                <%= link_to order.order_rows.count, order_path(order.id) %>
---
SELECT "order_rows".* FROM "order_rows" WHERE "order_rows"."order_id" = ?  [["order_id", 1]]
SELECT "orders".* FROM "orders" WHERE (merchant_id = '1')
SELECT COUNT(*) FROM "order_rows" WHERE "order_rows"."order_id" = ?  [["order_id", 1]]