livingSocial/app/views/orders/show.html.erb

SELECT "order_rows".* FROM "order_rows" WHERE "order_rows"."order_id" = ?  [["order_id", 1]]
---
          <tbody>
          <% @order.order_rows.each do |order_row| %>